app/controllers/posts_controller.rb

UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "sexsex"], ["updated_at", "2021-11-03 21:06:16.729337"], ["id", 1]]
---
    def update
        @post.update(post_params)

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "sex"], ["content", "sex"], ["created_at", "2021-11-04 08:39:44.961719"], ["updated_at", "2021-11-04 08:39:44.961719"]]
---
    def create
        @post = Post.create(post_params)