app/controllers/sessions_controller.rb

  def create
    #render plain: "Thanks you buddy!"
    user = User.find_by(email:params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", ""], ["LIMIT", 1]]